'use strict'
class ExtendedDate extends Date {
	day = this.getDate();
	month = this.getMonth();
	year = this.getFullYear();
	
	
	toLocaleDateString() {
		const showMonth=()=>{
			if (this.month - 9 < 0) return '0' + (this.month + 1);
			return this.month + 1;
		}
		return `${this.day}.${showMonth()}.${this.year}`;
	}
	sayDate() {
		const months = [
			"января", "февраля", "марта", "апреля", "мая",
			"июня", "июля", "августа", "сентября", "октября",
			"ноября", "декабря"
		];
		const days = [
			,
			"первое",
			"второе",
			"третье",
			"четвертое",
			"пятое",
			"шестое",
			"седьмое",
			"восьмое",
			"девятое",
			"десятое",
			"одиннадцатое",
			"двенадцатое",
			"тринадцатое",
			"четырнадцатое",
			"пятнадцатое",
			"шестнадцатое",
			"семнадцатое",
			"восемнадцатое",
			"девятнадцатое",
			"двадцатое",
			"двадцать первое",
			"двадцать второе",
			"двадцать третье",
			"двадцать четвертое",
			"двадцать пятое",
			"двадцать шестое",
			"двадцать седьмое",
			"двадцать восьмое",
			"двадцать девятое",
			"тридцатое",
			"тридцать первое"
		];
		return `${days[this.day]} ${months[this.month]}`;
	}
	isFuture(){
		const nowDate = new Date();
		return this > nowDate;
	}
	nextDay(){
		return  new Date(this.year, this.month, this.day + 1);
	}
	isLeapYear(){
		if ((this.year % 4 === 0 && this.year % 100 !== 0) || (this.year % 400 === 0)) {
			return true; 
		  } else {
			return false;
		  }
	}
}
console.table(
	[
		new ExtendedDate(2000, 8, 28),
		new ExtendedDate(2001, 1, 28),
		new ExtendedDate(Date.now() - 10 * 24 * 60 * 60 * 1000),
		new ExtendedDate,
		new ExtendedDate(Date.now() + 10 * 24 * 60 * 60 * 1000)
	].map(d => ({
		'дата': d.toLocaleDateString(),
		'прописью': d.sayDate(),
		'будущее?': d.isFuture(),
		'завтра': d.nextDay().toLocaleDateString(),
		'високосный?': d.isLeapYear()
	}))
);


// ##### пример вывода:

// ```
// ┌─────────┬──────────────┬────────────────────────────┬──────────┬──────────────┬─────────────┐
// │ (index) │ дата         │ прописью                   │ будущее? │ завтра       │ високосный? │
// ├─────────┼──────────────┼────────────────────────────┼──────────┼──────────────┼─────────────┤
// │ 0       │ '28.02.2000' │ 'двадцать восьмое февраля' │ false    │ '29.02.2000' │ true        │
// │ 1       │ '28.02.2001' │ 'двадцать восьмое февраля' │ false    │ '01.03.2001' │ false       │
// │ 2       │ '01.06.2024' │ 'первое июня'              │ false    │ '02.06.2024' │ true        │
// │ 3       │ '11.06.2024' │ 'одиннадцатое июня'        │ false    │ '12.06.2024' │ true        │
// │ 4       │ '21.06.2024' │ 'двадцать первое июня'     │ true     │ '22.06.2024' │ true        │
// └─────────┴──────────────┴────────────────────────────┴──────────┴──────────────┴─────────────┘
// ```